examples/regular_wave_3D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.com
    \\  /    A nd           | Version:  2512
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( 0 0 -1.0 )
    ( 4.0 0 -1.0 )
    ( 4.0 4.0 -1.0 )
    ( 0 4.0 -1.0 )
    ( 0 0 -0.03 )
    ( 4.0 0 -0.03 )
    ( 4.0 4.0 -0.03 )
    ( 0 4.0 -0.03 )
    ( 0 0 0.03 )
    ( 4.0 0 0.03 )
    ( 4.0 4.0 0.03 )
    ( 0 4.0 0.03 )
    ( 0 0 0.36 )
    ( 4.0 0 0.36 )
    ( 4.0 4.0 0.36 )
    ( 0 4.0 0.36 )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 200 24) simpleGrading (1 1 0.1)
    hex (4 5 6 7 8 9 10 11) (200 200 15) simpleGrading (1 1 1.0)
    hex (8 9 10 11 12 13 14 15) (200 200 12) simpleGrading (1 1 8)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
            (8 12 15 11)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
            (5 9 10 6)
            (9 13 14 10)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    top
    {
        type patch;
        faces
        (
            (12 13 14 15)
        );
    }
    front
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (7 11 10 6)
            (11 15 14 10)
        );
    }
    back
    {
        type patch;
        faces
        (
            (0 4 5 1)
            (4 8 9 5)
            (8 12 13 9)
        );
    }
);
